//package test;
//
//public class 자바기초용어모음 {
//    // 접근 제한자
//
//
//
//
//    // static
//    정적. 이미 메모리에 올려져있어서 호출하지 않아도 쓸 수 있다?
//
//
//
//    // final
//    상수. 변하지 않음
//
//
//
//    // super VS this
//    . super는 부모로 혹은 부모의 this는 현재 속한 인스턴스참조
//
//
//
//    // 오버로딩 VS 오버라이딩
//    오버로딩은 같은 클래스 내에서 생성자든 메서드든 매개변수 다르게해서 바꾸는거
//    오버라이딩은 다른 클래스에서 상속받은 자식클래스가 출력문만 다르게해서 바꾸는거
//
//
//
//    // abstract
//    추상 자식한테 물려줄때 사용
//
//
//
//    // interface VS abstract class
//    인터페이스는 자식의 행동을 다 정의하고 추상 메서드, 상수, 정적메서드, 디폴트메서드
//    추상클래스는 최소 하나의 추상메서드만 있으면 추상이고 보통 필드를 저장
//
//
//
//    // extends VS implements
//    추상 vs 인터페이스
//
//
//
//    // try-catch-finally
//    try에서 코드실행해서 에러뜨면 catch로 보내고 설정한 예외에러가 있으면 밑에 따로 구현가능하고 런타임이 멈추지않음
//    finally 기억안남
//
//
//
//}